lectures/vscode/vscode_lecture1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 Thu 22:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lecture 1: VS Code and LaTeX Workshop</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jang Soo Kim" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Lecture 1: VS Code and LaTeX Workshop</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6623a4c">1. Basics on VS Code</a>
<ul>
<li><a href="#org35df313">1.1. Overview</a></li>
<li><a href="#orgd9fae17">1.2. Installation</a></li>
<li><a href="#org1ae7a0e">1.3. Workspaces</a></li>
<li><a href="#orgcd845d3">1.4. Open folders</a>
<ul>
<li><a href="#org1525e41">1.4.1. Exercise</a></li>
</ul>
</li>
<li><a href="#org003bada">1.5. How to install extensions</a></li>
<li><a href="#org49b17e3">1.6. Command Palette</a></li>
<li><a href="#org916497b">1.7. How to change settings</a></li>
<li><a href="#orgbc8311b">1.8. How to change themes</a></li>
</ul>
</li>
<li><a href="#org2edcb39">2. LaTeX Workshop (extension)</a>
<ul>
<li><a href="#org946eb47">2.1. Installation</a></li>
<li><a href="#orgdce9af9">2.2. Basic commands</a>
<ul>
<li><a href="#orgf7db15c">2.2.1. Exercises</a></li>
</ul>
</li>
<li><a href="#org058ed2f">2.3. Move between sections or labels</a></li>
<li><a href="#orgb014c19">2.4. Some interesting features</a></li>
<li><a href="#orgc20c7d9">2.5. Snippets</a></li>
<li><a href="#org71ccb0d">2.6. More Snippets</a></li>
<li><a href="#org978ad29">2.7. Add Keyboard shortcuts</a>
<ul>
<li><a href="#orgbbf0923">2.7.1. Exercise</a></li>
</ul>
</li>
<li><a href="#org980dae5">2.8. Finding errors</a></li>
</ul>
</li>
<li><a href="#org4cd3df1">3. User Snippets</a>
<ul>
<li><a href="#orgf18d220">3.1. latex.json</a></li>
<li><a href="#org8c46360">3.2. Write user snippets (without arguments)</a>
<ul>
<li><a href="#orgcb3aa10">3.2.1. Example</a></li>
<li><a href="#org7e012ba">3.2.2. Example</a></li>
</ul>
</li>
<li><a href="#org8e6e7e9">3.3. Write user snippets (with arguments)</a>
<ul>
<li><a href="#org4a29929">3.3.1. Example</a></li>
<li><a href="#org08b2afa">3.3.2. Example (default arguments)</a></li>
</ul>
</li>
<li><a href="#orgcfcf09f">3.4. Exercises</a></li>
<li><a href="#org36185c2">3.5. More Exercises</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org6623a4c" class="outline-2">
<h2 id="org6623a4c"><span class="section-number-2">1</span> Basics on VS Code</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org35df313" class="outline-3">
<h3 id="org35df313"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>VS Code is a free source-code editor made by Microsoft.</li>
<li>It was released in 2015.</li>
<li>According to <a href="https://insights.stackoverflow.com/survey/2019#development-environments-and-tools">Developer Survey Results 2019</a>, VS Code is the most popular
development environment.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9fae17" class="outline-3">
<h3 id="orgd9fae17"><span class="section-number-3">1.2</span> Installation</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Download here: <a href="https://code.visualstudio.com/">https://code.visualstudio.com/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1ae7a0e" class="outline-3">
<h3 id="org1ae7a0e"><span class="section-number-3">1.3</span> Workspaces</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>A <i>workspace</i> in VS Code is a collection of folders.</li>
<li>For simplicity, we will have only one folder in a workspace.</li>
<li>So for us, a workspace is just a single folder (which of course may contain
many files and subfolders).</li>
<li>I recommend you to have one folder for one project (i.e., your
paper).</li>
<li>Always open a folder not a single file!</li>
</ul>
</div>
</div>
<div id="outline-container-orgcd845d3" class="outline-3">
<h3 id="orgcd845d3"><span class="section-number-3">1.4</span> Open folders</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Before you open a folder for the first time, make sure that you close
everything using "File \(\to\) Close Folder" in the menu bar.</li>
<li>By drag-and-drop you can open a folder.</li>
<li>It will create a workspace having all the contents in that folder.</li>
<li>You can open recent workspaces (i.e., folders for us) or files using <b>CTRL+R</b>,
which means "File: Open Recent".</li>
</ul>
</div>
<div id="outline-container-org1525e41" class="outline-4">
<h4 id="org1525e41"><span class="section-number-4">1.4.1</span> Exercise</h4>
<div class="outline-text-4" id="text-1-4-1">
<ol class="org-ol">
<li>Download <a href="vscode-lecture-files.zip">this file</a> and extract it in your computer.</li>
<li>Close everything in your VS Code.</li>
<li>Open the folder "tex-exercise" in VS Code.</li>
<li>Close everything in your VS Code.</li>
<li>Open the folder "bib-exercise" in VS Code.</li>
<li>Close everything in your VS Code.</li>
<li>Open the folder "git-exercise" in VS Code.</li>
<li>Open recent folders using <b>CTRL+R</b>.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org003bada" class="outline-3">
<h3 id="org003bada"><span class="section-number-3">1.5</span> How to install extensions</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Click the icon "Extensions" on the left.</li>
<li>Search the extension you want to install.</li>
<li>Click "Install".</li>
<li>Exercise: Install Latex Workshop.</li>
<li>Exercise: Install Code Spell Checker.</li>
<li>Using Code Spell Checker you can do "Quick fix": <b>CMD + .</b></li>
</ol>
</div>
</div>

<div id="outline-container-org49b17e3" class="outline-3">
<h3 id="org49b17e3"><span class="section-number-3">1.6</span> Command Palette</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><b>CMD + SHIFT + P</b> opens a command line showing all commands.</li>
<li>Note: <b>CMD</b> means Command Key for Mac and Control Key for Windows.</li>
<li>We will call this command line CP.</li>
<li>Probably the most important keyboard shortcut!</li>
<li>Very helpful when you forgot keyboard shortcuts.</li>
<li>You can also discover many things using CP.</li>
<li>Quiz: How can you make the minimap disappear?</li>
</ul>
<ul class="org-ul">
<li>Hint: Search "minimap" at CP, and you will get the answer.</li>
</ul>
</div>
</div>
<div id="outline-container-org916497b" class="outline-3">
<h3 id="org916497b"><span class="section-number-3">1.7</span> How to change settings</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>CP \(\rightarrow\) "Preferences: Open Settings (UI)" (or type <b>CMD+,</b>)</li>
<li>Search "Editor: Font Size".</li>
<li>Enter 14 (or any font size you want) in the box.</li>
<li>Exercise: Disable the line number.</li>
</ol>
</div>
</div>
<div id="outline-container-orgbc8311b" class="outline-3">
<h3 id="orgbc8311b"><span class="section-number-3">1.8</span> How to change themes</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Search "theme" at CP, and choose "Preferences: Color Theme".</li>
<li>You can check out more themes from extensions.
<ol class="org-ol">
<li>Install "Community Material Theme" extension.</li>
<li>Select "Community Material Theme Palenight (Higher Contrast)" from
"Preferences: Color Theme" as we did above.</li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2edcb39" class="outline-2">
<h2 id="org2edcb39"><span class="section-number-2">2</span> LaTeX Workshop (extension)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org946eb47" class="outline-3">
<h3 id="org946eb47"><span class="section-number-3">2.1</span> Installation</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>First you need to install LaTeX Workshop using "Extensions" icon as before.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdce9af9" class="outline-3">
<h3 id="orgdce9af9"><span class="section-number-3">2.2</span> Basic commands</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><b>TeX Compile</b> 
<ul class="org-ul">
<li>To build a pdf type <b>CMD + OPTION + B</b>.</li>
<li>If you forgot this, search "latex build" at CP.</li>
<li>Alternatively, you can simply save the tex file.</li>
<li>What's the shortcut for "Save"? (Hint: CP)</li>
</ul></li>
<li><b>View PDF</b>
<ul class="org-ul">
<li>To view a pdf, type <b>CMD + OPTION + V</b>.</li>
<li>If you forgot this, search "latex pdf" at CP.</li>
</ul></li>
<li><b>Inverse Search</b> (find source code from pdf)
<ul class="org-ul">
<li><b>CMD + left click on the pdf</b></li>
</ul></li>
<li><b>SyncTeX from cursor</b> (Forward Search)
<ul class="org-ul">
<li><b>CMD + OPTION + J</b></li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgf7db15c" class="outline-4">
<h4 id="orgf7db15c"><span class="section-number-4">2.2.1</span> Exercises</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li>Find the shortcuts for "Copy" and "Paste".</li>
<li>Discover what "Copy Line Up" and "Copy Line Down" mean.</li>
<li>Find the shortcut for "Find".</li>
<li>Find a way to comment a line.</li>
<li>Experiment with your finding in 4 by using its shortcut after selecting a
region.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org058ed2f" class="outline-3">
<h3 id="org058ed2f"><span class="section-number-3">2.3</span> Move between sections or labels</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Click the icon \(\mathrm{\TeX}\) on the left.</li>
<li>This will show the sidebar with sections and labels.</li>
<li>By clicking a section here you can move to that section in your tex file.</li>
<li>You can toggle the sidebar with <b>CMD + B</b>. If you forgot this, you know what
to do.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb014c19" class="outline-3">
<h3 id="orgb014c19"><span class="section-number-3">2.4</span> Some interesting features</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Auto Completion: Try to type <code>\begin{theorem}</code></li>
<li>Collapsing environments
<ul class="org-ul">
<li>Click the down arrow appearing at the left of an environment.</li>
</ul></li>
<li>Preview
<ul class="org-ul">
<li>Place your mouse pointer at an equation.</li>
</ul></li>
<li>Latex Snippet Panel 
<ul class="org-ul">
<li>CP \(\rightarrow\) "Latex Workshop: Show Snippet Panel"</li>
</ul></li>
<li>Typing "\ref{" shows all labels.
<ul class="org-ul">
<li>By clicking the arrow at the right corner, you can see the content of the
label.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc20c7d9" class="outline-3">
<h3 id="orgc20c7d9"><span class="section-number-3">2.5</span> Snippets</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>A <i>snippet</i> means a block of re-usable code, somewhat similar to macro.</li>
<li>If you type the "prefix" of a snippet and press <code>TAB</code> or <code>ENTER</code>, then it
will insert the "body" of the snippet.</li>
<li>@a: <code>\alpha</code></li>
<li>@(: <code>\left( \right)</code></li>
<li>@/: <code>\frac{}{}</code></li>
<li>bit: <code>\begin{itemize} ... \end{itemize}</code></li>
<li>fem: <code>\emph{}</code></li>
<li>mbf: <code>\mathbf{}</code></li>
<li>Typing a letter and <code>CTRL+SPC</code> will show all snippets whose prefix contains
that letter.</li>
</ul>
</div>
</div>
<div id="outline-container-org71ccb0d" class="outline-3">
<h3 id="org71ccb0d"><span class="section-number-3">2.6</span> More Snippets</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><p>
See the links below for more snippets.
<a href="https://github.com/James-Yu/LaTeX-Workshop/wiki/Snippets#Handy-mathematical-snippets">https://github.com/James-Yu/LaTeX-Workshop/wiki/Snippets#Handy-mathematical-snippets</a>
</p>

<p>
<a href="https://cheatography.com/jcwinkler/cheat-sheets/latex-workshop-visual-studio-code/#downloads">https://cheatography.com/jcwinkler/cheat-sheets/latex-workshop-visual-studio-code/#downloads</a>
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org978ad29" class="outline-3">
<h3 id="org978ad29"><span class="section-number-3">2.7</span> Add Keyboard shortcuts</h3>
<div class="outline-text-3" id="text-2-7">
<ol class="org-ol">
<li>CP \(\rightarrow\) Preferences: Open Keyboard Shortcuts</li>
<li>Search "Latex Workshop: Select the current environment content."</li>
<li>Double click this line and enter your desired key combination (e.g. <b>CMD+'</b>).</li>
</ol>
</div>
<div id="outline-container-orgbbf0923" class="outline-4">
<h4 id="orgbbf0923"><span class="section-number-4">2.7.1</span> Exercise</h4>
<div class="outline-text-4" id="text-2-7-1">
<ul class="org-ul">
<li>Setup a keyboard shortcut for "Latex Workshop: Select the current section".</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org980dae5" class="outline-3">
<h3 id="org980dae5"><span class="section-number-3">2.8</span> Finding errors</h3>
<div class="outline-text-3" id="text-2-8">
<ol class="org-ol">
<li>If there are some errors in your tex file, VS Code will show a message box
when you build LaTeX.</li>
<li>Click "Open compiler log" in the message box.</li>
<li>Click "Problems" in the small window at the bottom. You can make it bigger
by dragging its top.</li>
<li>Clicking a line in this window will send you to the precise location in
your tex file where the error occurs.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org4cd3df1" class="outline-2">
<h2 id="org4cd3df1"><span class="section-number-2">3</span> User Snippets</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf18d220" class="outline-3">
<h3 id="orgf18d220"><span class="section-number-3">3.1</span> latex.json</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>To write user snippets we need to open the "latex.json" file.</li>
<li>CP \(\rightarrow\) Preferences: Configure User Snippets</li>
<li>Find "latex (latex)" or "latex.json (latex)".</li>
<li>It will open the file latex.json.</li>
</ul>
</div>
</div>
<div id="outline-container-org8c46360" class="outline-3">
<h3 id="org8c46360"><span class="section-number-3">3.2</span> Write user snippets (without arguments)</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>In the latex.json file everything is enclosed by a pair of curly braces <code>{...}</code>.</li>
<li>You can write your own snippets inside this braces.</li>
<li><p>
Each snippet has the following structure.
</p>
<pre class="example">
"snippet name": {
    "prefix": "snippet key",
     "body": "snippet body"
}
</pre></li>
</ul>
</div>
<div id="outline-container-orgcb3aa10" class="outline-4">
<h4 id="orgcb3aa10"><span class="section-number-4">3.2.1</span> Example</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li><p>
Consider the following snippet.
</p>
<pre class="example">
"vandermonde determinant": {
    "prefix": "vdm", 
    "body": "\\prod_{1\\le i&lt;j\\le n} (x_i - x_j)" 
}
</pre></li>
<li><p>
This  snippet will insert the following when you press TAP after
typing vdm:
</p>
<pre class="example">
\prod_{1\le i&lt;j\le n} (x_i - x_j)
</pre></li>
<li>Notice that we must write two slashes <code>\\</code> to insert a single slash <code>\</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e012ba" class="outline-4">
<h4 id="org7e012ba"><span class="section-number-4">3.2.2</span> Example</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li>If you have more than one snippets, you must put a comma <code>,</code> after each
snippet.</li>
<li><p>
So, for example, your latex.jason file should look something like this
(notice the outermost pair of curly braces):
</p>
<pre class="example">
{
   "vandermonde determinant": {
       "prefix": "vdm", 
       "body": "\\prod_{1\\le i&lt;j\\le n} (x_i - x_j)" 
   },
   "vandermonde determinant2": {
       "prefix": "vdm2", 
       "body": "\\prod_{1\\le i&lt;j\\le n} (y_i - y_j)" 
   }
}
</pre></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8e6e7e9" class="outline-3">
<h3 id="org8e6e7e9"><span class="section-number-3">3.3</span> Write user snippets (with arguments)</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Using arguments you can create more flexible snippets.</li>
<li>Arguments are of this form <code>$1</code>, <code>$2</code>, etc., and <code>$0</code>.</li>
<li><code>$1</code>, <code>$2</code>, etc. mean the first argument and the second argument etc.</li>
<li>You will be asked to type these variables when you use the snippet.</li>
<li><code>$0</code> means the final location of the cursor when all the arguments have
been typed.</li>
</ul>
</div>
<div id="outline-container-org4a29929" class="outline-4">
<h4 id="org4a29929"><span class="section-number-4">3.3.1</span> Example</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li><p>
Consider the following snippet.
</p>
<pre class="example">
"vandermonde det": {
	"prefix": "vdm",
	"body": "\\prod_{1\\le i&lt;j\\le $1} ($2_i - $2_j)"
}
</pre></li>
<li>If you use this snippet, it will ask you to fill <code>$1</code> and then <code>$2</code>. You
can move to the next argument by pressing <code>TAB</code>.</li>
<li><p>
If you type <code>m</code> <code>TAB</code> <code>z</code> <code>TAB</code>, then the snippet will insert this:
</p>
<pre class="example">
\prod_{1\le i&lt;j\le m} (z_i - z_j)
</pre></li>
<li>Note that you need to type <code>$2</code> only once and it will be inserted twice as
designed.</li>
</ul>
</div>
</div>
<div id="outline-container-org08b2afa" class="outline-4">
<h4 id="org08b2afa"><span class="section-number-4">3.3.2</span> Example (default arguments)</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>You can also set default arguments using <code>${n:default}</code>.</li>
<li><p>
For example, the following snippet has default values <code>n</code> and <code>x</code> for the
arguments <code>$1</code> and <code>$2</code> respectively.
</p>
<pre class="example">
"vandermonde det": {
	"prefix": "vdm",
	"body": "\\prod_{1\\le i&lt;j\\le ${1:n} (${2:x}_i - $2_j)"
}
</pre></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcfcf09f" class="outline-3">
<h3 id="orgcfcf09f"><span class="section-number-3">3.4</span> Exercises</h3>
<div class="outline-text-3" id="text-3-4">
<ol class="org-ol">
<li><p>
Write a snippet that inserts the following and place the cursor in the
middle.
</p>
<pre class="example">
\langle  \rangle
</pre></li>
<li><p>
Write a snippet that inserts the following and place the cursor in the
middle. (Hint: a new line can be created using <code>\n</code>.)
</p>
<pre class="example">
\[

\]
</pre></li>
<li><p>
Write a snippet that inserts the following, where <code>x</code> and <code>n</code> are
given as default but can be changed to anything.
</p>
<pre class="example">
(x_1,x_2,\dots,x_n) 
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org36185c2" class="outline-3">
<h3 id="org36185c2"><span class="section-number-3">3.5</span> More Exercises</h3>
<div class="outline-text-3" id="text-3-5">
<ol class="org-ol">
<li><p>
LaTeX Workshop has the snippet <code>BCAS</code> that inserts the following.
</p>
<pre class="example">
\begin{cases}

\end{cases}
</pre>

<p>
Write your own snippet with the same prefix <code>BCAS</code> that inserts 
</p>
<pre class="example">
\begin{cases}
  A  &amp;  \mbox{if $B$},\\
  C  &amp;  \mbox{D}.
\end{cases}
</pre>

<p>
and asks you to fill A, B, C, D in this order, where D is set to be
<code>otherwise</code> by default, and locate the cursor below the line containing
<code>\end{cases}</code>.
</p></li>
<li>See what happens if you type <code>BCAS</code>.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2020-12-03 Thu 22:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
